<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
  <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css" integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z" crossorigin="anonymous">
  <script src="https://code.jquery.com/jquery-3.5.1.slim.min.js" integrity="sha384-DfXdz2htPH0lsSSs5nCTpuj/zy4C+OGpamoFVy38MVBnE+IbbVYUew+OrCXaRkfj" crossorigin="anonymous"></script>
  <script src="https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js" integrity="sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU+6BZp6G7niu735Sk7lN" crossorigin="anonymous"></script>
  <script src="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/js/bootstrap.min.js" integrity="sha384-B4gt1jrGC7Jh4AgTPSdUtOBvfO8shuf57BaghqFfPlYxofvL8/KUEfYiJOMMV+rV" crossorigin="anonymous"></script>

  <link rel="stylesheet" href="../../../basecss/base.css"/>

    <title>Первое задание</title>
</head>
<body>
<main>
<h2>Контрольные вопросы:</h2>
<ol>
  <li>
    <p>
      (15 б.) Расскажите, что такое итераторы и зачем они нужны.
    </p>
  </li>
  <li>
    <p>
      (15 б.) Какие структуры данных основаны на деревьях? Прокомментируйте функционал каждой из них.
    </p>
  </li>
</ol>
<h2>Упражнения:</h2>
<ol>
  <li>
    <p> (70 б.) Решите одну из классических задач на словари. Считайте с клавиатуры N чисел и определите количество
      повторений каждой из них. Выведите на экран пары &lt;число-вхождения&gt;, отсортированные по возрастанию числа.
      Подсказка: если вы обращаетесь по несуществующему ключу, то ошибки не будет. Будет
      сгенерирована новая пара ключ-значение со значением по умолчанию. Например, если у вас пустая
      std::map&lt;int, int&gt; your_map, и вы делаете std::cout << your_map[42], то выведется 0. Если сделать
      your_map[322] += 5, то по этому ключу будет лежать значение 0 + 5 = 5.
      Реализуйте вывод map-ы с помощью оператора &lt;&lt;.
    </p>
  </li>
</ol>
</main>
</body>
</html>