<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css"
          integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z" crossorigin="anonymous">
    <script src="https://code.jquery.com/jquery-3.5.1.slim.min.js"
            integrity="sha384-DfXdz2htPH0lsSSs5nCTpuj/zy4C+OGpamoFVy38MVBnE+IbbVYUew+OrCXaRkfj"
            crossorigin="anonymous"></script>
    <script src="https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js"
            integrity="sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU+6BZp6G7niu735Sk7lN"
            crossorigin="anonymous"></script>
    <script src="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/js/bootstrap.min.js"
            integrity="sha384-B4gt1jrGC7Jh4AgTPSdUtOBvfO8shuf57BaghqFfPlYxofvL8/KUEfYiJOMMV+rV"
            crossorigin="anonymous"></script>

    <link rel="stylesheet" href="../../../basecss/base.css"/>

    <title>Задание по девятому семинару</title>
</head>
<body>
<main>
    <h2>Контрольные вопросы</h2>
    <ol>
        <li> (15 б.) Расскажите, как используются ключевые слова try, throw, catch.
            Можно ли по-разному обработать разные исключения, вылетающие из одного
            и того же блока try?
        </li>
        <li> (15 б.) Что можно и что нельзя делать, если вы поймали исключение?
            Что означает нетранзакционность блока try? К каким проблемам это может привести?
            Как эти проблемы решены в Java и Python?
        </li>
    </ol>
    <h2>Упражнения:</h2>
    <ol>
        <li><h5>(50 б.) Второй максимальный элемент</h5>
            <p>
                В наборе из T последовательностей размера N для каждой последовательности
                найдите второй максимальный элемент для каждой смежной пересекающейся (см. пример)
                подпоследовательности размера K (K &le; N).
            </p>
            <h6>
                Формат ввода
            </h6>
            <p>
                Нулевой строкой вводится размер набора T. На 2i + 1 строке, i &in; [0 .. T] вводятся два числа Ni и Ki
                для следующей последовательности, а на 2i + 2 строке &mdash; сама последовательность размера Ni.
            </p>
            <h6>
                Формат вывода
            </h6>
            <p>
                Т строк с наборами искомых элементов для каждой последовательности.
            </p>
            <h6>
                Пример
            </h6>
            Ввод <br/>
            <code>
                2 <br/>
                5 2 <br/>
                3 4 6 3 4 <br/>
                7 4 <br/>
                3 4 5 8 1 4 10 <br/>
            </code>
            Вывод <br/>
            <code>
                3 4 3 3 <br/>
                5 5 5 8 <br/>
            </code>
            <p>Пояснение: для первой последовательности имеем Ni = 5, Ki = 2, подпоследовательности &mdash; это
                {3, 4}, {4, 6}, {6, 3} {3, 4}. Для второй Ni = 7, Ki = 4, подпоследовательности &mdash; это
                {3, 4, 5, 8}, {4, 5, 8, 1}, {5, 8, 1, 4}, {8, 1, 4, 10}.</p>
        </li>

        <li>
            <h5>(50 б.) Классические исключения и дробь</h5>
            <pre>
Реализуйте простой класс для хранения рациональных чисел в виде дроби с целыми числителем и
знаменателем. Реализуйте для данного класса базовые операторы для действий с рациональными числами.

Прототип класса:

class Rational {
public:
    // Конструктор дроби, здесь a - числитель, b - знаменатель
    Rational(int a, int b);

    // Реализуйте операторы:
    // - сложения двух дробей
    // - вычитания двух дробей
    // - умножения двух дробей
    // - деления двух дробей
    // - умножения дроби на целое число (должно работать при любом порядке операндов)
};
Также реализуйте оператор вывода, который должен выводить дробь в формате: a/b, и оператор ввода,
который должен получить дробь из формата a/b. Если дробь введена в нужном формате
&laquo;числосимволчисло&raquo;,
но при этом символ не является знаком деления, выбросите исключение с сообщением о том, что формат
данных некорректен.
Разработайте своё исключение или воспользуйтесь одним из стандартных.

В случае деления на 0 (в операторе, конструкторе или вводе при b = 0) выбросите другое исключение
с сообщением о том, что делить на 0 запрещено.

Также реализуйте сокращение дроби и <a href="https://metanit.com/cpp/tutorial/5.15.php">оператор приведения к double</a>.


Замечания:

Изначально это задачка, которую мы разобрали на семинаре.
Вы можете найти ту задачку в материалах контрольной 2019 года.
Но на этот раз вам необходимо её доработать.
Для тестирования можете использовать следующий пример:

int main()
{
    Rational a(1, 2);
    Rational b(2, 3);

    cout << a << endl;
    cout << b << endl;
    cout << a + b << endl;
    cout << a - b << endl;
    cout << a * b << endl;
    cout << a / b << endl;
    cout << 3 * a << endl;
    cout << b * 4 << endl;

    return 0;
}
Данный пример должен вывести:

1/2
2/3
7/6
-1/6
1/3
3/4
3/2
8/3
            </pre>
        </li>
    </ol>
</main>
</body>
</html>